/* 创建一个文本文件，内含20行，每行30个整数。这些整数都在0~9之间，用空格分开。
 * 该文件使用数字表示一张图片，0~9表示逐渐增加的灰度。编写一个程序，用文件中的
 * 内容读入一个20×30的int数组中。一种把这些数字转换为图片的粗略方法是：该程序
 * 使用数组中的值初始化一个大小为20×31的字符数组，用数值0对应空格字符，1对应点
 * 字符，此次类推。数字越大表示字符所占空间越大。例如，用#表示9。每行的最后一个
 * 字符（第31个）是空字符，这样该数组包含了20个字符串。最后，程序显示最终的图片
 * （即，打印所有的字符串），并将结果存储在文本文件中。例如，下面是开始的数据：
 * 0 0 9 0 0 0 0 0 0 0 0 0 5 8 9 9 8 5 2 0 0 0 0 0 0 0 0 0 0 0
 * 0 0 0 0 9 0 0 0 0 0 0 0 5 8 9 9 8 5 5 2 0 0 0 0 0 0 0 0 0 0
 * 0 0 0 0 0 0 0 0 0 0 0 0 5 8 1 9 8 5 4 5 2 0 0 0 0 0 0 0 0 0
 * 0 0 0 0 9 0 0 0 0 0 0 0 5 8 9 9 8 5 0 4 5 2 0 0 0 0 0 0 0 0
 * 0 0 9 0 0 0 0 0 0 0 0 0 5 8 9 9 8 5 0 0 4 5 2 0 0 0 0 0 0 0
 * 0 0 0 0 0 0 0 0 0 0 0 0 5 8 9 1 8 5 0 0 0 4 5 2 0 0 0 0 0 0
 * 0 0 0 0 0 0 0 0 0 0 0 0 5 8 9 9 8 5 0 0 0 0 4 5 2 0 0 0 0 0
 * 5 5 5 5 5 5 5 5 5 5 5 5 5 8 9 9 8 5 5 5 5 5 5 5 5 5 5 5 5 5
 * 8 8 8 8 8 8 8 8 8 8 8 8 5 8 9 9 8 5 8 8 8 8 8 8 8 8 8 8 8 8
 * 9 9 9 9 0 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 3 9 9 9 9 9 9 9
 * 8 8 8 8 8 8 8 8 8 8 8 8 5 8 9 9 8 5 8 8 8 8 8 8 8 8 8 8 8 8
 * 5 5 5 5 5 5 5 5 5 5 5 5 5 8 9 9 8 5 5 5 5 5 5 5 5 5 5 5 5 5
 * 0 0 0 0 0 0 0 0 0 0 0 0 5 8 9 9 8 5 0 0 0 0 0 0 0 0 0 0 0 0
 * 0 0 0 0 0 0 0 0 0 0 0 0 5 8 9 9 8 5 0 0 0 0 6 6 0 0 0 0 0 0
 * 0 0 0 0 2 2 0 0 0 0 0 0 5 8 9 9 8 5 0 0 5 6 0 0 6 5 0 0 0 0
 * 0 0 0 0 3 3 0 0 0 0 0 0 5 8 9 9 8 5 0 5 6 1 1 1 1 6 5 0 0 0
 * 0 0 0 0 4 4 0 0 0 0 0 0 5 8 9 9 8 5 0 0 5 6 0 0 6 5 0 0 0 0
 * 0 0 0 0 5 5 0 0 0 0 0 0 5 8 9 9 8 5 0 0 0 0 6 6 0 0 0 0 0 0
 * 0 0 0 0 0 0 0 0 0 0 0 0 5 8 9 9 8 5 0 0 0 0 0 0 0 0 0 0 0 0
 * 0 0 0 0 0 0 0 0 0 0 0 0 5 8 9 9 8 5 0 0 0 0 0 0 0 0 0 0 0 0
 * 根据以上的描述选择特定的输出字符，最终输出如下：
 */

#include <stdio.h>
#include <stdlib.h>
#define SIZE    40
#define ROWS    20
#define COLS    30

int main(void)
{
    FILE * fp;
    char name[SIZE];
    int arr[ROWS][COLS];
    int i, j;

    puts("Plese input the filename.");
    scanf("%s", name);

    if((fp = fopen(name, "r")) == NULL)
    {
        printf("Can't open file %s.\n", name);
        exit(EXIT_FAILURE);
    }
    for(i = 0; i < ROWS; i++)
        for(j = 0; j < COLS; j++)
            fscanf(fp, "%d", &arr[i][j]);
    for(i = 0; i < ROWS; i++)
    {
        for(j = 0; j < COLS; j++)
        {
            switch(arr[i][j])
            {
                case 0: putchar(' '); break;
                case 1: putchar('.'); break;
                case 2: putchar('\''); break;
                case 3: putchar(':'); break;
                case 4: putchar('~'); break;
                case 5: putchar('*'); break;
                case 6: putchar('='); break;
                case 7: putchar('+'); break;
                case 8: putchar('%'); break;
                case 9: putchar('#'); break;
                default: printf("Error!");
            }
        }
        putchar('\n');
    }
    return 0;
}
